defl/hokku_epaper/firmware/huessen_epf1301/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash - 16MB actual (board reports 16384k)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Console on USB Serial/JTAG (built-in USB)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA — enable app rollback. An OTA'd app boots PENDING_VERIFY and must call
# esp_ota_mark_app_valid_cancel_rollback() (done after a successful refresh);
# otherwise the bootloader reverts to the previous slot on the next boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Compiler — performance build (-O2), not debug (-Og)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# CPU — 240 MHz (ESP32-S3 max)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Instruction cache — 32 KB (firmware binary is ~700 KB; 16 KB thrashes)
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# Chip revision — firmware targets v0.2+ only; disables S32C1I SPIRAM workaround
CONFIG_ESP32S3_REV_MIN_2=y

# Run code and rodata from PSRAM — eliminates flash/PSRAM XIP cache contention
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Main task stack (display + WiFi + HTTP needs headroom)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM (8MB octal, embedded in ESP32-S3-WROOM-1)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# WiFi - allocate buffers in SPIRAM when possible
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# SNTP
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# DHCP — skip the post-ACK gratuitous-ARP duplicate-address check. On mesh APs
# with client isolation / proxy-ARP the check stalls, so the lease is granted
# by the router but the STA never binds and IP_EVENT_STA_GOT_IP never fires
# (association succeeds, DHCP ACK arrives, then bind hangs). Disabling it makes
# the STA bind immediately on ACK.
CONFIG_LWIP_DHCP_DOES_NOT_CHECK_OFFERED_IP=y
